tap "homebrew/bundle"
tap "homebrew/services"

brew "awscli"
brew "bat"
brew "cmake"
brew "coreutils"
brew "dockutil"
brew "eza"
brew "ffmpeg"
brew "gh"
brew "git"
brew "grep"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "neovim"
brew "tmux"
brew "tree"
brew "volta"
brew "wget"
brew "zinit"
brew "zsh"

cask "1password"
cask "arc"
cask "dash"
cask "discord"
cask "dropbox"
cask "firefox"
cask "gitup"
cask "google-chrome"
cask "iterm2"
cask "little-snitch"
cask "keka"
cask "kitty"
cask "ngrok"
cask "notion"
cask "raycast"
cask "readdle-spark"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
