#tap "context-labs/mactop"
tap "homebrew/bundle"
#tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "homeport/tap"

# CLI

brew "awscli"
brew "azure-cli"
brew "bat"
brew "cmake"
brew "coreutils"
brew "dnscontrol"
brew "dockutil"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-flow"
brew "git-lfs"
brew "git"
brew "glab"
brew "grep"
#brew "guumaster/tap/hostctl"
brew "helm"
brew "httpie"
brew "hurl"
brew "imagemagick"
brew "jq"
brew "lazygit"
#brew "mactop"
brew "mas"
brew "neovim"
brew "node@20"
#brew "nvm"
#brew "postgresql"
brew "python"
brew "ranger"
#brew "termshot"
brew "terraform"
brew "tldr"
brew "tmux"
brew "tree"
brew "volta"
brew "wget"
brew "zinit"
brew "zsh"

# Applications

cask "1password"
cask "arc"
cask "aws-vault"
cask "blender"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "figma"
cask "firefox"
cask "github"
cask "gitup"
cask "google-chrome"
cask "google-cloud-sdk"
cask "insomnium"
cask "iterm2"
cask "openlens"
cask "little-snitch"
#cask "keka"
cask "ngrok"
cask "notion"
cask "postico"
cask "raycast"
cask "readdle-spark"
#cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# Fonts

# cask "font-0xproto-nerd-font"
# cask "font-3270-nerd-font"
# cask "font-agave-nerd-font"
# cask "font-anonymice-nerd-font"
# cask "font-arimo-nerd-font"
# cask "font-aurulent-sans-mono-nerd-font"
# cask "font-bigblue-terminal-nerd-font"
# cask "font-bitstream-vera-sans-mono-nerd-font"
# cask "font-blex-mono-nerd-font"
# cask "font-caskaydia-cove-nerd-font"
# cask "font-caskaydia-mono-nerd-font"
# cask "font-code-new-roman-nerd-font"
# cask "font-comic-shanns-mono-nerd-font"
# cask "font-cousine-nerd-font"
# cask "font-d2coding-nerd-font"
# cask "font-daddy-time-mono-nerd-font"
# cask "font-dejavu-sans-mono-nerd-font"
# cask "font-droid-sans-mono-nerd-font"
# cask "font-envy-code-r-nerd-font"
# cask "font-fantasque-sans-mono-nerd-font"
# cask "font-fira-code-nerd-font"
# cask "font-fira-mono-nerd-font"
# cask "font-geist-mono-nerd-font"
# cask "font-go-mono-nerd-font"
# cask "font-gohufont-nerd-font"
# cask "font-hasklug-nerd-font"
# cask "font-heavy-data-nerd-font"
# cask "font-hurmit-nerd-font"
# cask "font-im-writing-nerd-font"
# cask "font-inconsolata-go-nerd-font"
# cask "font-inconsolata-lgc-nerd-font"
# cask "font-intone-mono-nerd-font"
# cask "font-iosevka-nerd-font"
# cask "font-iosevka-term-nerd-font"
# cask "font-iosevka-term-slab-nerd-font"
# cask "font-lekton-nerd-font"
# cask "font-liberation-nerd-font"
# cask "font-lilex-nerd-font"
# cask "font-martian-mono-nerd-font"
# cask "font-monaspace-nerd-font"
# cask "font-monocraft-nerd-font"
# cask "font-monofur-nerd-font"
# cask "font-monoid-nerd-font"
# cask "font-mononoki-nerd-font"
# cask "font-mplus-nerd-font"
# cask "font-noto-nerd-font"
# cask "font-open-dyslexic-nerd-font"
# cask "font-overpass-nerd-font"
# cask "font-profont-nerd-font"
# cask "font-proggy-clean-tt-nerd-font"
# cask "font-shure-tech-mono-nerd-font"
# cask "font-space-mono-nerd-font"
# cask "font-symbols-only-nerd-font"
# cask "font-terminess-ttf-nerd-font"
# cask "font-tinos-nerd-font"
# cask "font-ubuntu-mono-nerd-font"
# cask "font-ubuntu-nerd-font"
# cask "font-victor-mono-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"

# VSCode

vscode "aaron-bond.better-comments"
vscode "bradgashler.htmltagwrap"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dcasella.monokai-plusplus"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-todo-plus"
vscode "GitHub.copilot"
vscode "GitLab.gitlab-workflow"
vscode "hediet.vscode-drawio"
vscode "HTMLHint.vscode-htmlhint"
vscode "mechatroner.rainbow-csv"
vscode "mrmartineau.rigel-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.sublime-keybindings"
vscode "redhat.vscode-yaml"
vscode "steoates.autoimport"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "whatwedo.twig"
vscode "YoavBls.pretty-ts-errors"